Documents/ВнесениеИзмененийВоВнутреннийПеречень.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ВнесениеИзмененийВоВнутреннийПеречень</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ВнутренниеПеречни</xr:Item>
				<xr:Item>InformationRegister.ОснованияВнесенияВПеречень</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеречня</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПеречнейОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИзменения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИзмененийПеречней</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектИнсайдерскойИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыВнутреннихПеречней</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьЧленаСоветаДиректоров</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодтверждающиеДокументыКвалифицированногоИнвестора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИсключенияКвалифицированногоЛица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийДокумент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НормативныйАкт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НормативныеАкты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НормативныеАкты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыАктивовКвалифицированныхИнвесторов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидАктива</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыВнутреннихПеречней</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Тип</Name>
					<Comment>Тип</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Comment>Представление</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначенияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Языки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Comment>Вид</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ВнесениеИзмененийВоВнутреннийПеречень/Forms/ПечатьИзмененийВРеестреКвалифицированныхИнвесторов/Ext/Form/Module.bsl
#Область События_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.Документ, "Объект,Дата,ВидПеречня,ВидИзменения,ПричинаИсключенияКвалифицированногоЛица");
	
	ПроверитьРеквизитыДокумента(РеквизитыДокумента, Параметры.ЗаявлениеНаВключение, Отказ);
	Если Отказ Тогда	
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.Клиент										= РеквизитыДокумента.Объект;
	ЭтаФорма.Организация								= ПараметрыСеанса.ТекущаяОрганизация;
	ЭтаФорма.ДатаЗаявления								= РеквизитыДокумента.Дата;
	ЭтаФорма.ДатаПоступленияЗаявления					= ЭтаФорма.ДатаЗаявления;
	ЭтаФорма.ВидИзменения 								= РеквизитыДокумента.ВидИзменения;
	ЭтаФорма.ПричинаИсключенияКвалифицированногоЛица	= РеквизитыДокумента.ПричинаИсключенияКвалифицированногоЛица;
	
	Параметры.Свойство("ЗаявлениеНаВключение", ЭтаФорма.ЗаявлениеНаВключение);
		
	Если Клиент.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо Тогда
		Элементы.ГруппаУполномоченноеЛицоКлиента.Видимость = Ложь;
	КонецЕсли;
	
	РезультатЗапроса = Документы.ВнесениеИзмененийВоВнутреннийПеречень.РезультатЗапросаПоВидамАктивов(ЭтаФорма.Организация, РеквизитыДокумента.Объект, Параметры.Документ.МоментВремени());
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СписокВидовАктивовДоИзменения.Добавить(Выборка.ВидАктива);
	КонецЦикла;	
	
	ЗаполнитьСписокВидовАктивовИПодтверждающиеДокументыНаСервере();

	// Если для вида Изменение состав видов активов не изменился, ничего не печатаем
	Если ВидИзменения = Перечисления.ВидыИзмененийПеречней.Изменение Тогда
		СтруктураИзменений = Документы.ВнесениеИзмененийВоВнутреннийПеречень.СформироватьСтруктуруИзмененийСоставаВидовАктивов(СписокВидовАктивовДоИзменения.ВыгрузитьЗначения(), СписокВидовАктивовИзДокумента.ВыгрузитьЗначения());
		Если СтруктураИзменений.ДобавленныеВидыАктивов.Количество() = 0 И СтруктураИзменений.УдаленныеВидыАктивов.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ не содержит изменений в составе видов активов",,,, Отказ);
			Возврат;
		КонецЕсли;
	КонецЕсли;		
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Клиент.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо Тогда
		
		УдаляемыйРеквизит = ПроверяемыеРеквизиты.Найти("УполномоченноеЛицоКлиента");
		
		Если УдаляемыйРеквизит <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(УдаляемыйРеквизит);
		КонецЕсли;
		
		УдаляемыйРеквизит = ПроверяемыеРеквизиты.Найти("ОснованиеУполномоченногоЛицаКлиента");
		
		Если УдаляемыйРеквизит <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(УдаляемыйРеквизит);
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти


#Область События_элементов_формы

&НаКлиенте
Процедура СотрудникОрганизацииПринявшийЗаявлениеПриИзменении(Элемент)
	
	СотрудникПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникОрганизацииПринявшийЗаявлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникОрганизацииПринявшийЗаявлениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СотрудникОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура УполномоченноеЛицоОрганизацииПриИзменении(Элемент)
	
	СотрудникПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура УполномоченноеЛицоОрганизацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура УполномоченноеЛицоОрганизацииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СотрудникОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область Команды_формы

&НаКлиенте
Процедура Печать(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		
		ДанныеДляПечати = ПолучитьДанныеДляПечатиНаСервере();
		
		Если ДанныеДляПечати <> Неопределено Тогда
			
			Шаблоны = ПолучитьИзВременногоХранилища(ДанныеДляПечати.АдресШаблонов);
			
			WordApp = Новый COMОбъект("Word.Application");
			
			ФайлЗаявления = ПолучитьИмяВременногоФайла("docx");
			Шаблоны.Заявление.Записать(ФайлЗаявления);
			ЗаполнитьИПоказатьШаблон(WordApp,	ФайлЗаявления,		ДанныеДляПечати.ДанныеЗаявления);
							
			ФайлУведомления = ПолучитьИмяВременногоФайла("docx");
			Шаблоны.Уведомление.Записать(ФайлУведомления);
		 	ЗаполнитьИПоказатьШаблон(WordApp,	ФайлУведомления,	ДанныеДляПечати.ДанныеУведомления);
			
			// Уведомление о последствиях требуется только для физ. лиц
			Если ЭтаФорма.ЗаявлениеНаВключение И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Клиент, "ВидЮрФизЛица") = ПредопределенноеЗначение("Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо") Тогда				
				ФайлУведомленияОПоследствиях = ПолучитьИмяВременногоФайла("docx");
				Шаблоны.УведомлениеОПоследствиях.Записать(ФайлУведомленияОПоследствиях);
			 	ЗаполнитьИПоказатьШаблон(WordApp,	ФайлУведомленияОПоследствиях,	ДанныеДляПечати.ДанныеУведомления);			
			КонецЕсли; 
			
			WordApp.Application.Visible = Истина;
			
			ЭтаФорма.Закрыть();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Служебные_процедуры_и_функции

&НаСервере
Функция ПолучитьДанныеДляПечатиНаСервере()
	
	Результат = Новый Структура;
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("ЮрЛицоОрганизации",		Организация.ЮрФизЛицо);
	Запрос.УстановитьПараметр("ДатаЗаявления",			ДатаЗаявления);
	Запрос.УстановитьПараметр("Клиент",					Клиент);
	Запрос.УстановитьПараметр("ПредставительКлиента", 	УполномоченноеЛицоКлиента);
	Запрос.УстановитьПараметр("Ответственный",			СтруктураДанныхСотрудникОрганизацииПринявшийЗаявление.КонтактноеЛицо);
	
	ВидЮрФизЛица = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Клиент, "ВидЮрФизЛица");
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.КраткоеНаименованиеПоУставу КАК НаименованиеОрганизации,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ПолноеНаименованиеПоУставу КАК ОрганизацияПолноеНаименование,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ВебСтраница КАК Сайт
		|ПОМЕСТИТЬ _ДанныеОрганизации
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|			&ДатаЗаявления,
		|			Организация = &Организация
		|				И ЮрФизЛицо = &ЮрЛицоОрганизации
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних";
	
	Запрос.Текст = Запрос.Текст + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";
				
	Если ЭтаФорма.ЗаявлениеНаВключение Тогда 
		
		Если ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо Тогда
			
			#Область Текст_запроса_для_заявления_на_включение_физического_лица
		    			
			Запрос.Текст = Запрос.Текст + 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Период КАК Период,
				|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Фамилия КАК Фамилия,
				|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Имя КАК Имя,
				|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Отчество КАК Отчество,
				|	ВЫБОР
				|		КОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.ВидУдостоверенияЛичности = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ)
				|			ТОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.СерияУдостоверенияЛичности
				|		ИНАЧЕ НЕОПРЕДЕЛЕНО
				|	КОНЕЦ КАК СерияПаспорта,
				|	ВЫБОР
				|		КОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.ВидУдостоверенияЛичности = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ)
				|			ТОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.НомерУдостоверенияЛичности
				|		ИНАЧЕ НЕОПРЕДЕЛЕНО
				|	КОНЕЦ КАК НомерПаспорта,
				|	ВЫБОР
				|		КОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.ВидУдостоверенияЛичности = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ)
				|			ТОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.ОрганВыдавшийУдостоверениеЛичности
				|		ИНАЧЕ НЕОПРЕДЕЛЕНО
				|	КОНЕЦ КАК КемВыдан,
				|	ВЫБОР
				|		КОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.ВидУдостоверенияЛичности = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ)
				|			ТОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.ДатаВыдачиУдостоверенияЛичности
				|		ИНАЧЕ НЕОПРЕДЕЛЕНО
				|	КОНЕЦ КАК ДатаВыдачи,
				|	ВЫБОР
				|		КОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.ВидУдостоверенияЛичности = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ)
				|			ТОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.КодОрганаВыдавшегоУдостоверениеЛичности
				|		ИНАЧЕ НЕОПРЕДЕЛЕНО
				|	КОНЕЦ КАК КодПодразделения,
				|	РеквизитыФизическихЛицАнкетныеСрезПоследних.АдресРегистрации КАК АдресРегистрации,
				|	РеквизитыФизическихЛицАнкетныеСрезПоследних.АдресМестаЖительства КАК АдресПроживания,
				|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ДатаРождения КАК ДатаРождения,
				|	РеквизитыФизическихЛицАнкетныеСрезПоследних.МестоРождения КАК МестоРождения,
				|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Гражданство КАК Гражданство,
				|	РеквизитыФизическихЛицАнкетныеСрезПоследних.РезидентРФ КАК РезидентРФ,
				|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ИНН КАК ИНН,
				|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ВидУдостоверенияЛичности КАК ВидУдостоверенияЛичности,
				|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Телефоны КАК Телефоны,
				|	РеквизитыФизическихЛицАнкетныеСрезПоследних.EMail КАК EMail
				|ПОМЕСТИТЬ _Реквизиты
				|ИЗ
				|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
				|			&ДатаЗаявления,
				|			ЮрФизЛицо = &Клиент
				|				И Организация = &Организация
				|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	РеквизитыФизическихЛицСрезПоследних.Период,
				|	РеквизитыФизическихЛицСрезПоследних.Фамилия,
				|	РеквизитыФизическихЛицСрезПоследних.Имя,
				|	РеквизитыФизическихЛицСрезПоследних.Отчество,
				|	ВЫБОР
				|		КОГДА РеквизитыФизическихЛицСрезПоследних.ВидУдостоверенияЛичности = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ)
				|			ТОГДА РеквизитыФизическихЛицСрезПоследних.СерияУдостоверенияЛичности
				|		ИНАЧЕ НЕОПРЕДЕЛЕНО
				|	КОНЕЦ,
				|	ВЫБОР
				|		КОГДА РеквизитыФизическихЛицСрезПоследних.ВидУдостоверенияЛичности = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ)
				|			ТОГДА РеквизитыФизическихЛицСрезПоследних.НомерУдостоверенияЛичности
				|		ИНАЧЕ НЕОПРЕДЕЛЕНО
				|	КОНЕЦ,
				|	ВЫБОР
				|		КОГДА РеквизитыФизическихЛицСрезПоследних.ВидУдостоверенияЛичности = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ)
				|			ТОГДА РеквизитыФизическихЛицСрезПоследних.ОрганВыдавшийУдостоверениеЛичности
				|		ИНАЧЕ НЕОПРЕДЕЛЕНО
				|	КОНЕЦ,
				|	ВЫБОР
				|		КОГДА РеквизитыФизическихЛицСрезПоследних.ВидУдостоверенияЛичности = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ)
				|			ТОГДА РеквизитыФизическихЛицСрезПоследних.ДатаВыдачиУдостоверенияЛичности
				|		ИНАЧЕ НЕОПРЕДЕЛЕНО
				|	КОНЕЦ,
				|	ВЫБОР
				|		КОГДА РеквизитыФизическихЛицСрезПоследних.ВидУдостоверенияЛичности = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ)
				|			ТОГДА РеквизитыФизическихЛицСрезПоследних.КодОрганаВыдавшегоУдостоверениеЛичности
				|		ИНАЧЕ НЕОПРЕДЕЛЕНО
				|	КОНЕЦ,
				|	"" "",
				|	"" "",
				|	РеквизитыФизическихЛицСрезПоследних.ДатаРождения,
				|	РеквизитыФизическихЛицСрезПоследних.МестоРождения,
				|	РеквизитыФизическихЛицСрезПоследних.Гражданство,
				|	РеквизитыФизическихЛицСрезПоследних.РезидентРФ,
				|	РеквизитыФизическихЛицСрезПоследних.ИНН,
				|	РеквизитыФизическихЛицСрезПоследних.ВидУдостоверенияЛичности,
				|	"" "",
				|	"" ""
				|ИЗ
				|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
				|			&ДатаЗаявления,
				|			ЮрФизЛицо = &Клиент
				|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
				|				И Организация = &Организация) КАК РеквизитыФизическихЛицСрезПоследних
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ ПЕРВЫЕ 1
				|	_Реквизиты.Фамилия КАК Фамилия,
				|	_Реквизиты.Имя КАК Имя,
				|	_Реквизиты.Отчество КАК Отчество,
				|	_Реквизиты.СерияПаспорта КАК СерияПаспорта,
				|	_Реквизиты.НомерПаспорта КАК НомерПаспорта,
				|	_Реквизиты.КемВыдан КАК КемВыдан,
				|	_Реквизиты.ДатаВыдачи КАК ДатаВыдачи,
				|	_Реквизиты.КодПодразделения КАК КодПодразделения,
				|	_Реквизиты.АдресРегистрации КАК АдресРегистрации,
				|	_Реквизиты.АдресПроживания КАК АдресПроживания,
				|	_Реквизиты.ДатаРождения КАК ДатаРождения,
				|	_Реквизиты.МестоРождения КАК МестоРождения,
				|	_Реквизиты.Гражданство КАК Гражданство,
				|	_Реквизиты.РезидентРФ КАК РезидентРФ,
				|	_Реквизиты.ИНН КАК ИНН,
				|	_Реквизиты.ВидУдостоверенияЛичности КАК ВидУдостоверенияЛичности,
				|	_Реквизиты.Телефоны КАК Телефон,
				|	_Реквизиты.EMail КАК ЭлектроннаяПочта,
				|	_Реквизиты.Период КАК Период,
				|	ПОДСТРОКА(_Реквизиты.Имя, 1, 1) + "". "" + ПОДСТРОКА(_Реквизиты.Отчество, 1, 1) + "". "" + _Реквизиты.Фамилия КАК ИнициалыФамилия
				|ПОМЕСТИТЬ _ДанныеДляЗаявления
				|ИЗ
				|	_Реквизиты КАК _Реквизиты
				|
				|УПОРЯДОЧИТЬ ПО
				|	Период УБЫВ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Фамилия КАК Фамилия,
				|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Имя КАК Имя,
				|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Отчество КАК Отчество,
				|	РеквизитыФизическихЛицАнкетныеСрезПоследних.АдресРегистрации КАК АдресРегистрации,
				|	ПОДСТРОКА(РеквизитыФизическихЛицАнкетныеСрезПоследних.Имя, 1, 1) + "". "" + ПОДСТРОКА(РеквизитыФизическихЛицАнкетныеСрезПоследних.Отчество, 1, 1) + "". "" + РеквизитыФизическихЛицАнкетныеСрезПоследних.Фамилия КАК ИнициалыФамилия
				|ПОМЕСТИТЬ _ДанныеДляУведомления
				|ИЗ
				|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
				|			&ДатаЗаявления,
				|			ЮрФизЛицо = &Клиент
				|				И Организация = &Организация
				|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних";	
			
			#КонецОбласти
		
		Иначе
		
			#Область Текст_запроса_для_заявления_на_включение_юридического_лица
			
			Запрос.Текст = Запрос.Текст + 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.Период КАК Период,
				|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.РезидентРФ КАК РезидентРФ,
				|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ИНН КАК ИНН,
				|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.Телефоны КАК Телефон,
				|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.EMail КАК EMail,
				|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.КраткоеНаименованиеПоУставу КАК КраткоеНаименованиеПоУставу,
				|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеПоУставу,
				|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ОрганизационноПравоваяФорма.Наименование КАК ОПФ,
				|	ЕСТЬNULL(РеквизитыЮридическихЛицАнкетныеАнглийскийСрезПоследних.ПолноеНаименованиеПоУставу, ""  "") КАК НаименованиеНаИностранномЯзыке,
				|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ОГРН КАК ОГРН,
				|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.КПП КАК КПП,
				|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ДатаВыдачиОГРН КАК ДатаРегистрации,
				|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ОрганВыдавшийОГРН КАК ОрганРегистрации,
				|	ВЫБОР
				|		КОГДА РеквизитыЮридическихЛицАнкетныеСрезПоследних.РезидентРФ
				|			ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия) КАК Справочник.СтраныМира).Наименование
				|		ИНАЧЕ РеквизитыЮридическихЛицАнкетныеСрезПоследних.СтранаРегистрации.Наименование
				|	КОНЕЦ КАК МестоРегистрации,
				|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮридическийАдресФИАС КАК ЮридическийАдрес,
				|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ФактическийАдресФИАС КАК ФактическийАдрес,
				|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.Факсы КАК Факс,
				|	РеквизитыФизическихЛицПредставителяСрезПоследних.Фамилия КАК Фамилия,
				|	РеквизитыФизическихЛицПредставителяСрезПоследних.Имя КАК Имя,
				|	РеквизитыФизическихЛицПредставителяСрезПоследних.Отчество КАК Отчество,
				|	ВЫБОР
				|		КОГДА РеквизитыФизическихЛицПредставителяСрезПоследних.ВидУдостоверенияЛичности = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ)
				|			ТОГДА РеквизитыФизическихЛицПредставителяСрезПоследних.СерияУдостоверенияЛичности
				|		ИНАЧЕ НЕОПРЕДЕЛЕНО
				|	КОНЕЦ КАК СерияПаспорта,
				|	ВЫБОР
				|		КОГДА РеквизитыФизическихЛицПредставителяСрезПоследних.ВидУдостоверенияЛичности = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ)
				|			ТОГДА РеквизитыФизическихЛицПредставителяСрезПоследних.НомерУдостоверенияЛичности
				|		ИНАЧЕ НЕОПРЕДЕЛЕНО
				|	КОНЕЦ КАК НомерПаспорта,
				|	ВЫБОР
				|		КОГДА РеквизитыФизическихЛицПредставителяСрезПоследних.ВидУдостоверенияЛичности = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ)
				|			ТОГДА РеквизитыФизическихЛицПредставителяСрезПоследних.ОрганВыдавшийУдостоверениеЛичности
				|		ИНАЧЕ НЕОПРЕДЕЛЕНО
				|	КОНЕЦ КАК КемВыдан,
				|	ВЫБОР
				|		КОГДА РеквизитыФизическихЛицПредставителяСрезПоследних.ВидУдостоверенияЛичности = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ)
				|			ТОГДА РеквизитыФизическихЛицПредставителяСрезПоследних.ДатаВыдачиУдостоверенияЛичности
				|		ИНАЧЕ НЕОПРЕДЕЛЕНО
				|	КОНЕЦ КАК ДатаВыдачи,
				|	ВЫБОР
				|		КОГДА РеквизитыФизическихЛицПредставителяСрезПоследних.ВидУдостоверенияЛичности = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ)
				|			ТОГДА РеквизитыФизическихЛицПредставителяСрезПоследних.КодОрганаВыдавшегоУдостоверениеЛичности
				|		ИНАЧЕ НЕОПРЕДЕЛЕНО
				|	КОНЕЦ КАК КодПодразделения,
				|	РеквизитыФизическихЛицПредставителяСрезПоследних.ВидУдостоверенияЛичности КАК ВидУдостоверенияЛичности,
				|	РеквизитыФизическихЛицПредставителяСрезПоследних.ДатаРождения КАК ДатаРождения,
				|	РеквизитыФизическихЛицПредставителяСрезПоследних.МестоРождения КАК МестоРождения,
				|	ВЫБОР
				|		КОГДА РеквизитыФизическихЛицПредставителяСрезПоследних.РезидентРФ
				|			ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия) КАК Справочник.СтраныМира).Наименование
				|		ИНАЧЕ РеквизитыФизическихЛицПредставителяСрезПоследних.Гражданство.Наименование
				|	КОНЕЦ КАК Гражданство,
				|	РеквизитыФизическихЛицПредставителяСрезПоследних.РезидентРФ КАК РезидентРФПредставителя,
				|	РеквизитыФизическихЛицПредставителяСрезПоследних.ИНН КАК ИННПредставителя,
				|	РеквизитыФизическихЛицПредставителяСрезПоследних.ВидУдостоверенияЛичности КАК ВидДокумента,
				|	ПОДСТРОКА(РеквизитыФизическихЛицПредставителяСрезПоследних.Имя, 1, 1) + "". "" + ПОДСТРОКА(РеквизитыФизическихЛицПредставителяСрезПоследних.Отчество, 1, 1) + "". "" + РеквизитыФизическихЛицПредставителяСрезПоследних.Фамилия КАК Представитель,
				|	ПОДСТРОКА(РеквизитыСотрудниковОрганизацииСрезПоследних.Имя, 1, 1) + "". "" + ПОДСТРОКА(РеквизитыСотрудниковОрганизацииСрезПоследних.Отчество, 1, 1) + "". "" + РеквизитыСотрудниковОрганизацииСрезПоследних.Фамилия КАК Ответственный
				|ПОМЕСТИТЬ _Реквизиты
				|ИЗ
				|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
				|			&ДатаЗаявления,
				|			ЮрФизЛицо = &Клиент
				|				И Организация = &Организация
				|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
				|				&ДатаЗаявления,
				|				ЮрФизЛицо = &Клиент
				|					И Организация = &Организация
				|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Английский)) КАК РеквизитыЮридическихЛицАнкетныеАнглийскийСрезПоследних
				|		ПО РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо = РеквизитыЮридическихЛицАнкетныеАнглийскийСрезПоследних.ЮрФизЛицо,
				|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
				|			&ДатаЗаявления,
				|			ЮрФизЛицо = &ПредставительКлиента
				|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
				|				И Организация = &Организация) КАК РеквизитыФизическихЛицПредставителяСрезПоследних,
				|	РегистрСведений.РеквизитыСотрудниковОрганизации.СрезПоследних(
				|			&ДатаЗаявления,
				|			ЮрФизЛицо = &Ответственный
				|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
				|				И Организация = &Организация) КАК РеквизитыСотрудниковОрганизацииСрезПоследних
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ ПЕРВЫЕ 1
				|	_Реквизиты.Период КАК Период,
				|	_Реквизиты.РезидентРФ КАК РезидентРФ,
				|	_Реквизиты.ИНН КАК ИНН,
				|	_Реквизиты.Телефон КАК Телефон,
				|	_Реквизиты.EMail КАК EMail,
				|	_Реквизиты.КраткоеНаименованиеПоУставу КАК КраткоеНаименованиеПоУставу,
				|	_Реквизиты.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеПоУставу,
				|	_Реквизиты.ОПФ КАК ОПФ,
				|	_Реквизиты.НаименованиеНаИностранномЯзыке КАК НаименованиеНаИностранномЯзыке,
				|	_Реквизиты.ОГРН КАК ОГРН,
				|	_Реквизиты.КПП КАК КПП,
				|	_Реквизиты.ДатаРегистрации КАК ДатаРегистрации,
				|	_Реквизиты.ОрганРегистрации КАК ОрганРегистрации,
				|	_Реквизиты.МестоРегистрации КАК МестоРегистрации,
				|	_Реквизиты.ЮридическийАдрес КАК ЮридическийАдрес,
				|	_Реквизиты.ФактическийАдрес КАК ФактическийАдрес,
				|	_Реквизиты.Факс КАК Факс,
				|	_Реквизиты.Фамилия КАК Фамилия,
				|	_Реквизиты.Имя КАК Имя,
				|	_Реквизиты.Отчество КАК Отчество,
				|	_Реквизиты.СерияПаспорта КАК СерияПаспорта,
				|	_Реквизиты.НомерПаспорта КАК НомерПаспорта,
				|	_Реквизиты.КемВыдан КАК КемВыдан,
				|	_Реквизиты.ДатаВыдачи КАК ДатаВыдачи,
				|	_Реквизиты.КодПодразделения КАК КодПодразделения,
				|	_Реквизиты.ВидУдостоверенияЛичности КАК ВидУдостоверенияЛичности,
				|	_Реквизиты.ДатаРождения КАК ДатаРождения,
				|	_Реквизиты.МестоРождения КАК МестоРождения,
				|	_Реквизиты.Гражданство КАК Гражданство,
				|	_Реквизиты.РезидентРФПредставителя КАК РезидентРФПредставителя,
				|	_Реквизиты.ИННПредставителя КАК ИННПредставителя,
				|	_Реквизиты.ВидДокумента КАК ВидДокумента,
				|	_Реквизиты.Представитель КАК Представитель,
				|	_Реквизиты.Ответственный КАК Ответственный
				|ПОМЕСТИТЬ _ДанныеДляЗаявления
				|ИЗ
				|	_Реквизиты КАК _Реквизиты
				|
				|УПОРЯДОЧИТЬ ПО
				|	_Реквизиты.Период УБЫВ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ПолноеНаименованиеПоУставу КАК ПолноеНаименование,
				|	КонтактнаяИнформацияСрезПоследних.Представление КАК ЮридическийАдрес
				|ПОМЕСТИТЬ _ДанныеДляУведомления
				|ИЗ
				|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
				|			&ДатаЗаявления,
				|			ЮрФизЛицо = &Клиент
				|				И Организация = &Организация
				|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних,
				|	РегистрСведений.КонтактнаяИнформация.СрезПоследних(
				|			&ДатаЗаявления,
				|			Объект = &Клиент
				|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
				|				И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
				|				И Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮридическийАдрес)) КАК КонтактнаяИнформацияСрезПоследних";			
			
			#КонецОбласти
			
		КонецЕсли;
		
	Иначе
		
		Если ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо Тогда
			
			#Область Текст_запроса_для_заявления_на_исключение_юридического_лица
			
			Запрос.Текст = Запрос.Текст +
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ПолноеНаименованиеПоУставу КАК ПолноеНаименование,
				|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ОГРН КАК ОГРН,
				|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ИНН КАК ИНН,
				|	КонтактнаяИнформацияСрезПоследних.Представление КАК ЮридическийАдрес,
				|	РеквизитыФизическихЛицПредставителяСрезПоследних.Фамилия КАК Фамилия,
				|	РеквизитыФизическихЛицПредставителяСрезПоследних.Имя КАК Имя,
				|	РеквизитыФизическихЛицПредставителяСрезПоследних.Отчество КАК Отчество,
				|	ПОДСТРОКА(РеквизитыФизическихЛицПредставителяСрезПоследних.Имя, 1, 1) + "". "" + ПОДСТРОКА(РеквизитыФизическихЛицПредставителяСрезПоследних.Отчество, 1, 1) + "". "" + РеквизитыФизическихЛицПредставителяСрезПоследних.Фамилия КАК Представитель,
				|	ПОДСТРОКА(РеквизитыСотрудниковОрганизацииСрезПоследних.Имя, 1, 1) + "". "" + ПОДСТРОКА(РеквизитыСотрудниковОрганизацииСрезПоследних.Отчество, 1, 1) + "". "" + РеквизитыСотрудниковОрганизацииСрезПоследних.Фамилия КАК Ответственный
				|ПОМЕСТИТЬ _ДанныеДляЗаявления
				|ИЗ
				|	РегистрСведений.КонтактнаяИнформация.СрезПоследних(
				|			&ДатаЗаявления,
				|			Объект = &Клиент
				|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
				|				И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
				|				И Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮридическийАдрес)) КАК КонтактнаяИнформацияСрезПоследних,
				|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
				|			&ДатаЗаявления,
				|			ЮрФизЛицо = &Клиент
				|				И Организация = &Организация
				|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних,
				|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
				|			&ДатаЗаявления,
				|			ЮрФизЛицо = &ПредставительКлиента
				|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
				|				И Организация = &Организация) КАК РеквизитыФизическихЛицПредставителяСрезПоследних,
				|	РегистрСведений.РеквизитыСотрудниковОрганизации.СрезПоследних(
				|			&ДатаЗаявления,
				|			ЮрФизЛицо = &Ответственный
				|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
				|				И Организация = &Организация) КАК РеквизитыСотрудниковОрганизацииСрезПоследних
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ПолноеНаименованиеПоУставу КАК ПолноеНаименование,
				|	КонтактнаяИнформацияСрезПоследних.Представление КАК ЮридическийАдрес
				|ПОМЕСТИТЬ _ДанныеДляУведомления
				|ИЗ
				|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
				|			&ДатаЗаявления,
				|			ЮрФизЛицо = &Клиент
				|				И Организация = &Организация
				|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних,
				|	РегистрСведений.КонтактнаяИнформация.СрезПоследних(
				|			&ДатаЗаявления,
				|			Объект = &Клиент
				|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
				|				И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
				|				И Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮридическийАдрес)) КАК КонтактнаяИнформацияСрезПоследних";
			
			#КонецОбласти 
			
		Иначе
			
			#Область Текст_запроса_для_заявления_на_исключение_физического_лица
			
			Запрос.Текст = Запрос.Текст + 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Фамилия КАК Фамилия,
				|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Имя КАК Имя,
				|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Отчество КАК Отчество,
				|	ВЫБОР
				|		КОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.ВидУдостоверенияЛичности = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ)
				|			ТОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.СерияУдостоверенияЛичности
				|		ИНАЧЕ НЕОПРЕДЕЛЕНО
				|	КОНЕЦ КАК СерияПаспорта,
				|	ВЫБОР
				|		КОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.ВидУдостоверенияЛичности = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ)
				|			ТОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.НомерУдостоверенияЛичности
				|		ИНАЧЕ НЕОПРЕДЕЛЕНО
				|	КОНЕЦ КАК НомерПаспорта,
				|	ВЫБОР
				|		КОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.ВидУдостоверенияЛичности = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ)
				|			ТОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.ОрганВыдавшийУдостоверениеЛичности
				|		ИНАЧЕ НЕОПРЕДЕЛЕНО
				|	КОНЕЦ КАК КемВыдан,
				|	ВЫБОР
				|		КОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.ВидУдостоверенияЛичности = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ)
				|			ТОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.ДатаВыдачиУдостоверенияЛичности
				|		ИНАЧЕ НЕОПРЕДЕЛЕНО
				|	КОНЕЦ КАК ДатаВыдачи,
				|	ВЫБОР
				|		КОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.ВидУдостоверенияЛичности = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ)
				|			ТОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.КодОрганаВыдавшегоУдостоверениеЛичности
				|		ИНАЧЕ НЕОПРЕДЕЛЕНО
				|	КОНЕЦ КАК КодПодразделения,
				|	РеквизитыФизическихЛицАнкетныеСрезПоследних.АдресРегистрации КАК АдресРегистрации,
				|	РеквизитыФизическихЛицАнкетныеСрезПоследних.АдресМестаЖительства КАК АдресПроживания,
				|	ПОДСТРОКА(РеквизитыФизическихЛицАнкетныеСрезПоследних.Имя, 1, 1) + "". "" + ПОДСТРОКА(РеквизитыФизическихЛицАнкетныеСрезПоследних.Отчество, 1, 1) + "". "" + РеквизитыФизическихЛицАнкетныеСрезПоследних.Фамилия КАК ИнициалыФамилия
				|ПОМЕСТИТЬ _ДанныеДляЗаявления
				|ИЗ
				|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
				|			&ДатаЗаявления,
				|			ЮрФизЛицо = &Клиент
				|				И Организация = &Организация
				|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Фамилия КАК Фамилия,
				|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Имя КАК Имя,
				|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Отчество КАК Отчество,
				|	РеквизитыФизическихЛицАнкетныеСрезПоследних.АдресРегистрации КАК АдресРегистрации,
				|	ПОДСТРОКА(РеквизитыФизическихЛицАнкетныеСрезПоследних.Имя, 1, 1) + "". "" + ПОДСТРОКА(РеквизитыФизическихЛицАнкетныеСрезПоследних.Отчество, 1, 1) + "". "" + РеквизитыФизическихЛицАнкетныеСрезПоследних.Фамилия КАК ИнициалыФамилия
				|ПОМЕСТИТЬ _ДанныеДляУведомления
				|ИЗ
				|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
				|			&ДатаЗаявления,
				|			ЮрФизЛицо = &Клиент
				|				И Организация = &Организация
				|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних";
			
			#КонецОбласти 
			
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.Выполнить();
	
	ДанныеОбОрганизаци				= Запрос.МенеджерВременныхТаблиц.Таблицы["_ДанныеОрганизации"].ПолучитьДанные().Выгрузить();
	ДанныеОКлиентеДляЗаявления		= Запрос.МенеджерВременныхТаблиц.Таблицы["_ДанныеДляЗаявления"].ПолучитьДанные().Выгрузить();
	ДанныеОКлиентеДляУведомления	= Запрос.МенеджерВременныхТаблиц.Таблицы["_ДанныеДляУведомления"].ПолучитьДанные().Выгрузить();
	
	ДанныеЗаявления		= Новый Структура;
	ДанныеУведомления	= Новый Структура;
	
	Если ДанныеОбОрганизаци.Количество() > 0 Тогда
		ДанныеУведомления.Вставить("Организация", 					ДанныеОбОрганизаци[0].НаименованиеОрганизации);
		ДанныеУведомления.Вставить("ОрганизацияПолноеНаименование", ДанныеОбОрганизаци[0].ОрганизацияПолноеНаименование);
		ДанныеУведомления.Вставить("Сайт", 							ДанныеОбОрганизаци[0].Сайт);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Печать не будет выполнена! Не удалось определить данные об организации.");
		Возврат Неопределено;
	КонецЕсли;
	
	#Область Данные_для_заявления
	Если ДанныеОКлиентеДляЗаявления.Количество() > 0 Тогда
				
		Если ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо Тогда
			
			#Область Юридическое_лицо
			
			Если ДанныеОбОрганизаци.Количество() > 0 Тогда
				ДанныеЗаявления.Вставить("Организация", 	ДанныеОбОрганизаци[0].НаименованиеОрганизации);
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Печать не будет выполнена! Не удалось определить данные об организации.");
				Возврат Неопределено;
			КонецЕсли;
			
			ДанныеЗаявления.Вставить("Ответственный",				ДанныеОКлиентеДляЗаявления[0].Ответственный);
			ДанныеЗаявления.Вставить("Представитель",				ДанныеОКлиентеДляЗаявления[0].Представитель);
			
			Если ЭтаФорма.ЗаявлениеНаВключение Тогда
							
				ДанныеЗаявления.Вставить("ПолноеНаименованиеПоУставу",		ДанныеОКлиентеДляЗаявления[0].ПолноеНаименованиеПоУставу);
				ДанныеЗаявления.Вставить("КраткоеНаименованиеПоУставу",		ДанныеОКлиентеДляЗаявления[0].КраткоеНаименованиеПоУставу);
				ДанныеЗаявления.Вставить("НаименованиеНаИностранномЯзыке",	ДанныеОКлиентеДляЗаявления[0].НаименованиеНаИностранномЯзыке);				
				ДанныеЗаявления.Вставить("ОПФ",								ДанныеОКлиентеДляЗаявления[0].ОПФ);				
				ДанныеЗаявления.Вставить("ОГРН",							ДанныеОКлиентеДляЗаявления[0].ОГРН);
				ДанныеЗаявления.Вставить("ДатаРегистрации",					ДанныеОКлиентеДляЗаявления[0].ДатаРегистрации);
				ДанныеЗаявления.Вставить("ОрганРегистрации",				ДанныеОКлиентеДляЗаявления[0].ОрганРегистрации);
				ДанныеЗаявления.Вставить("МестоРегистрации", 				ДанныеОКлиентеДляЗаявления[0].МестоРегистрации);
				ДанныеЗаявления.Вставить("ИНН",								ДанныеОКлиентеДляЗаявления[0].ИНН);
				ДанныеЗаявления.Вставить("КПП",								ДанныеОКлиентеДляЗаявления[0].КПП);
				ДанныеЗаявления.Вставить("РезидентРФ",						ДанныеОКлиентеДляЗаявления[0].РезидентРФ);
				ДанныеЗаявления.Вставить("НеРезидентРФ",					Не ДанныеОКлиентеДляЗаявления[0].РезидентРФ);
				ДанныеЗаявления.Вставить("КПП",								ДанныеОКлиентеДляЗаявления[0].КПП);
				ДанныеЗаявления.Вставить("Телефон",							ДанныеОКлиентеДляЗаявления[0].Телефон);
				ДанныеЗаявления.Вставить("Факс",							?(ПустаяСтрока(ДанныеОКлиентеДляЗаявления[0].Факс), "  ", ДанныеОКлиентеДляЗаявления[0].Факс));
				ДанныеЗаявления.Вставить("ЭлектроннаяПочта",				ДанныеОКлиентеДляЗаявления[0].EMail);
				
				ЮридическийАдрес 	= ДанныеОКлиентеДляЗаявления[0].ЮридическийАдрес;
				СтруктураАдреса 	= РаботаСКонтактнойИнформациейКлиентСервер.АдресФИАСВСтруктуру(ЮридическийАдрес);				
				ДобавитьАдресВСтруктуруДанных(ДанныеЗаявления, СтруктураАдреса);
				
				ФактическийАдрес 	= ДанныеОКлиентеДляЗаявления[0].ФактическийАдрес;
				СтруктураАдреса 	= РаботаСКонтактнойИнформациейКлиентСервер.АдресФИАСВСтруктуру(ФактическийАдрес);
				ДобавитьАдресВСтруктуруДанных(ДанныеЗаявления, СтруктураАдреса, "Фактический");
			
				ДанныеЗаявления.Вставить("Фамилия",						ДанныеОКлиентеДляЗаявления[0].Фамилия);
				ДанныеЗаявления.Вставить("Имя",							ДанныеОКлиентеДляЗаявления[0].Имя);
				ДанныеЗаявления.Вставить("Отчество",					ДанныеОКлиентеДляЗаявления[0].Отчество);
				ДанныеЗаявления.Вставить("ДатаРождения",				ДанныеОКлиентеДляЗаявления[0].ДатаРождения);
				ДанныеЗаявления.Вставить("МестоРождения",				ДанныеОКлиентеДляЗаявления[0].МестоРождения);
				ДанныеЗаявления.Вставить("РезидентРФПредст",		 	ДанныеОКлиентеДляЗаявления[0].РезидентРФПредставителя);
				ДанныеЗаявления.Вставить("НеРезидентРФПредст", 			Не ДанныеОКлиентеДляЗаявления[0].РезидентРФПредставителя);
				ДанныеЗаявления.Вставить("ИННПредставителя",			?(ПустаяСтрока(ДанныеОКлиентеДляЗаявления[0].ИННПредставителя) , "  ", ДанныеОКлиентеДляЗаявления[0].ИННПредставителя));				
				ДанныеЗаявления.Вставить("СерияПаспорта",				ДанныеОКлиентеДляЗаявления[0].СерияПаспорта);
				ДанныеЗаявления.Вставить("НомерПаспорта",				ДанныеОКлиентеДляЗаявления[0].НомерПаспорта);
				ДанныеЗаявления.Вставить("КемВыдан",					ДанныеОКлиентеДляЗаявления[0].КемВыдан);
				ДанныеЗаявления.Вставить("ДатаВыдачи",					ДанныеОКлиентеДляЗаявления[0].ДатаВыдачи);
				ДанныеЗаявления.Вставить("КодПодразделения",			ДанныеОКлиентеДляЗаявления[0].КодПодразделения);
				ДанныеЗаявления.Вставить("Гражданство",					ДанныеОКлиентеДляЗаявления[0].Гражданство);				
										
				Если ТипЗнч(ДанныеОКлиентеДляЗаявления[0].ВидУдостоверенияЛичности) = Тип("СправочникСсылка.ВидыДокументовФизическихЛиц") 
					И ЗначениеЗаполнено(ДанныеОКлиентеДляЗаявления[0].ВидУдостоверенияЛичности) Тогда
					
					ПаспортРФ 						= ДанныеОКлиентеДляЗаявления[0].ВидУдостоверенияЛичности = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ;
					ПаспортИностранногоГражданина 	= ДанныеОКлиентеДляЗаявления[0].ВидУдостоверенияЛичности = Справочники.ВидыДокументовФизическихЛиц.ПаспортИностранногоГражданина;
					ИнойДокумент 					= Не (ПаспортРФ Или ПаспортИностранногоГражданина);
					
					Если ИнойДокумент Тогда
						Документ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеОКлиентеДляЗаявления[0].ВидУдостоверенияЛичности, "Наименование"); 
					Иначе
						Документ = " ";					
					КонецЕсли; 		
					
					ДанныеЗаявления.Вставить("ПаспортРФ",		ПаспортРФ);
					ДанныеЗаявления.Вставить("ИнострДокумент",	ПаспортИностранногоГражданина);
					ДанныеЗаявления.Вставить("ИнойДокумент",	ИнойДокумент);
					ДанныеЗаявления.Вставить("Документ",		Документ);
					
				КонецЕсли;
				
				ДобавитьДанныеОПодтверждающихДокументахВСтруктуруДанных(ДанныеЗаявления, СтруктураПодтверждающихДокументов, 4);
				
			Иначе
				
				ДанныеЗаявления.Вставить("ФИО",				ДанныеОКлиентеДляЗаявления[0].Фамилия + " " + ДанныеОКлиентеДляЗаявления[0].Имя + " " + ДанныеОКлиентеДляЗаявления[0].Отчество);				
				ДанныеЗаявления.Вставить("Наименование",	ДанныеОКлиентеДляЗаявления[0].ПолноеНаименование);
				ДанныеЗаявления.Вставить("ОГРН",			ДанныеОКлиентеДляЗаявления[0].ОГРН);
				ДанныеЗаявления.Вставить("ИНН",				ДанныеОКлиентеДляЗаявления[0].ИНН);
				ДанныеЗаявления.Вставить("Адрес",			ДанныеОКлиентеДляЗаявления[0].ЮридическийАдрес);
				
			КонецЕсли;
			
			#КонецОбласти
			
		Иначе
			
			#Область Физическое_лицо
			
			ДанныеЗаявления.Вставить("ФИО",					ДанныеОКлиентеДляЗаявления[0].Фамилия + " " + ДанныеОКлиентеДляЗаявления[0].Имя + " " + ДанныеОКлиентеДляЗаявления[0].Отчество);
			ДанныеЗаявления.Вставить("СерияПаспорта",		ДанныеОКлиентеДляЗаявления[0].СерияПаспорта);
			ДанныеЗаявления.Вставить("НомерПаспорта",		ДанныеОКлиентеДляЗаявления[0].НомерПаспорта);
			ДанныеЗаявления.Вставить("КемВыдан",			ДанныеОКлиентеДляЗаявления[0].КемВыдан);
			ДанныеЗаявления.Вставить("ДатаВыдачи",			Формат(ДанныеОКлиентеДляЗаявления[0].ДатаВыдачи, "ДФ=dd.MM.yyyy"));
			ДанныеЗаявления.Вставить("КодПодразделения",	ДанныеОКлиентеДляЗаявления[0].КодПодразделения);
			ДанныеЗаявления.Вставить("АдресРегистрации",	ДанныеОКлиентеДляЗаявления[0].АдресРегистрации);
			ДанныеЗаявления.Вставить("АдресПроживания",		ДанныеОКлиентеДляЗаявления[0].АдресПроживания);
			ДанныеЗаявления.Вставить("ИнициалыФамилия", 	ДанныеОКлиентеДляЗаявления[0].ИнициалыФамилия);
			
			Если ЗначениеЗаполнено(ДанныеОКлиентеДляЗаявления[0].Имя)
				И ЗначениеЗаполнено(ДанныеОКлиентеДляЗаявления[0].Отчество) Тогда
				ДанныеЗаявления.Вставить("Заявитель", ДанныеОКлиентеДляЗаявления[0].Фамилия + " " + Лев(ДанныеОКлиентеДляЗаявления[0].Имя, 1) + "." + Лев(ДанныеОКлиентеДляЗаявления[0].Отчество, 1) + ".");
			Иначе
				ДанныеЗаявления.Вставить("Заявитель", ДанныеОКлиентеДляЗаявления[0].Фамилия + " " + ДанныеОКлиентеДляЗаявления[0].Имя + " " + ДанныеОКлиентеДляЗаявления[0].Отчество);
			КонецЕсли;                              			
			
				
			Если ДанныеОбОрганизаци.Количество() > 0 Тогда
				ДанныеЗаявления.Вставить("Организация", 	ДанныеОбОрганизаци[0].НаименованиеОрганизации);
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Печать не будет выполнена! Не удалось определить данные об организации.");
				Возврат Неопределено;
			КонецЕсли;
			
			Если ЭтаФорма.ЗаявлениеНаВключение Тогда
				
				ДанныеЗаявления.Вставить("Фамилия",				ДанныеОКлиентеДляЗаявления[0].Фамилия);
				ДанныеЗаявления.Вставить("Имя",					ДанныеОКлиентеДляЗаявления[0].Имя);
				ДанныеЗаявления.Вставить("Отчество",			ДанныеОКлиентеДляЗаявления[0].Отчество);
				ДанныеЗаявления.Вставить("ДатаРождения",		ДанныеОКлиентеДляЗаявления[0].ДатаРождения);
				ДанныеЗаявления.Вставить("МестоРождения",		ДанныеОКлиентеДляЗаявления[0].МестоРождения);
				ДанныеЗаявления.Вставить("РезидентРФ", 			ДанныеОКлиентеДляЗаявления[0].РезидентРФ);
				ДанныеЗаявления.Вставить("НеРезидентРФ", 		Не ДанныеОКлиентеДляЗаявления[0].РезидентРФ);
				ДанныеЗаявления.Вставить("ИНН",					ДанныеОКлиентеДляЗаявления[0].ИНН);
				
				Если ТипЗнч(ДанныеОКлиентеДляЗаявления[0].Гражданство) = Тип("СправочникСсылка.СтраныМира") 
					И ЗначениеЗаполнено(ДанныеОКлиентеДляЗаявления[0].Гражданство) Тогда
					Гражданство = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеОКлиентеДляЗаявления[0].Гражданство, "НаименованиеПолное"); 
				Иначе
					Гражданство = " ";
				КонецЕсли; 
				
				ДанныеЗаявления.Вставить("Гражданство",			Гражданство);
				
				Если ТипЗнч(ДанныеОКлиентеДляЗаявления[0].ВидУдостоверенияЛичности) = Тип("СправочникСсылка.ВидыДокументовФизическихЛиц") 
					И ЗначениеЗаполнено(ДанныеОКлиентеДляЗаявления[0].ВидУдостоверенияЛичности) Тогда
					
					ПаспортРФ = ДанныеОКлиентеДляЗаявления[0].ВидУдостоверенияЛичности = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ;
					ПаспортИностранногоГражданина = ДанныеОКлиентеДляЗаявления[0].ВидУдостоверенияЛичности = Справочники.ВидыДокументовФизическихЛиц.ПаспортИностранногоГражданина;
					ИнойДокумент = Не (ПаспортРФ Или ПаспортИностранногоГражданина);
					
					Если ИнойДокумент Тогда
						Документ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеОКлиентеДляЗаявления[0].ВидУдостоверенияЛичности, "Наименование"); 
					Иначе
						Документ = " ";					
					КонецЕсли; 		
					
					ДанныеЗаявления.Вставить("ПаспортРФ",		ПаспортРФ);
					ДанныеЗаявления.Вставить("ИнострДокумент",	ПаспортИностранногоГражданина);
					ДанныеЗаявления.Вставить("ИнойДокумент",	ИнойДокумент);
					ДанныеЗаявления.Вставить("Документ",		Документ);
					
				Иначе
					
					ДанныеЗаявления.Вставить("ПаспортРФ", 		Ложь);
					ДанныеЗаявления.Вставить("ИнострДокумент", 	Ложь);
					ДанныеЗаявления.Вставить("ИнойДокумент", 	Ложь);
					ДанныеЗаявления.Вставить("Документ",		" ");
					
				КонецЕсли; 				
				
				Адрес = ?(ЗначениеЗаполнено(ДанныеОКлиентеДляЗаявления[0].АдресРегистрации), ДанныеОКлиентеДляЗаявления[0].АдресРегистрации, ДанныеОКлиентеДляЗаявления[0].АдресПроживания);
				
				ДанныеЗаявления.Вставить("Индекс", 				" ");
				ДанныеЗаявления.Вставить("Регион", 				" ");
				ДанныеЗаявления.Вставить("Страна", 				" ");
				ДанныеЗаявления.Вставить("НаселенныйПункт", 	" ");
				ДанныеЗаявления.Вставить("Адрес", 				Адрес);
				ДанныеЗаявления.Вставить("Телефон", 			ДанныеОКлиентеДляЗаявления[0].Телефон);
				ДанныеЗаявления.Вставить("Факс", 				" ");
				ДанныеЗаявления.Вставить("ЭлектроннаяПочта", 	ДанныеОКлиентеДляЗаявления[0].ЭлектроннаяПочта);
								
			КонецЕсли; 
			
			ДанныеЗаявления.Вставить("ВсеВидыАктивов", 		ВидИзменения = Перечисления.ВидыИзмененийПеречней.Исключение);
			ДанныеЗаявления.Вставить("НеВсеВидыАктивов", 	ВидИзменения <> Перечисления.ВидыИзмененийПеречней.Исключение);
			
			ДобавитьДанныеОПодтверждающихДокументахВСтруктуруДанных(ДанныеЗаявления, СтруктураПодтверждающихДокументов, 5);
				  			
			Если ЗначениеЗаполнено(СтруктураДанныхСотрудникОрганизацииПринявшийЗаявление) Тогда
				ДанныеЗаявления.Вставить("Ответственный",	Строка(СтруктураДанныхСотрудникОрганизацииПринявшийЗаявление.КонтактноеЛицо));	
			КонецЕсли;
			
			#КонецОбласти
			
		КонецЕсли;
		
		ДобавитьВидыАктивовВСтруктуруДанных(ДанныеЗаявления, ЗаявлениеНаВключение, СписокВидовАктивовДоИзменения.ВыгрузитьЗначения(), СписокВидовАктивовИзДокумента.ВыгрузитьЗначения());
		
		ДанныеЗаявления.Вставить("Основание",		    ?(ЗначениеЗаполнено(ОснованиеУполномоченногоЛицаКлиента), ОснованиеУполномоченногоЛицаКлиента, "  ")); 
		ДанныеЗаявления.Вставить("ДеньЗаявления",		Формат(ДатаЗаявления, "ДФ=дд"));
		ДанныеЗаявления.Вставить("МесяцЗаявления",		Формат(ДатаЗаявления, "ДФ=MM"));
		ДанныеЗаявления.Вставить("ГодЗаявления",		Формат(ДатаЗаявления, "ДФ=гггг"));
		ДанныеЗаявления.Вставить("ДеньПоступления",		Формат(ДатаПоступленияЗаявления, "ДФ=дд"));
		ДанныеЗаявления.Вставить("МесяцПоступления",	Формат(ДатаПоступленияЗаявления, "ДФ=MM"));
		ДанныеЗаявления.Вставить("ГодПоступления",		Формат(ДатаПоступленияЗаявления, "ДФ=гггг"));
		
		ДанныеЗаявления.Вставить("ВсеВидыАктивов", 	ВидИзменения = Перечисления.ВидыИзмененийПеречней.Исключение);
		ДанныеЗаявления.Вставить("НеВсеВидыАктивов", 	ВидИзменения <> Перечисления.ВидыИзмененийПеречней.Исключение);
		
		Результат.Вставить("ДанныеЗаявления",	ДанныеЗаявления);
		
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Печать не будет выполнена! Не удалось определить данные о клиенте для заполнения заявления.");
		Возврат Неопределено;
	КонецЕсли;
	
	#КонецОбласти
	
	#Область Данные_для_уведомления
	
	Если ДанныеОКлиентеДляУведомления.Количество() > 0 Тогда
		
		Если ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо Тогда
			ДанныеУведомления.Вставить("Наименование",		ДанныеОКлиентеДляУведомления[0].ПолноеНаименование);
			ДанныеУведомления.Вставить("Адрес",				ДанныеОКлиентеДляУведомления[0].ЮридическийАдрес);
		Иначе
			ДанныеУведомления.Вставить("Наименование",		ДанныеОКлиентеДляУведомления[0].Фамилия + " " + ДанныеОКлиентеДляУведомления[0].Имя + " " + ДанныеОКлиентеДляУведомления[0].Отчество);
			ДанныеУведомления.Вставить("ИнициалыФамилия", 	ДанныеОКлиентеДляУведомления[0].ИнициалыФамилия);
			ДанныеУведомления.Вставить("Адрес",				ДанныеОКлиентеДляУведомления[0].АдресРегистрации);
		КонецЕсли;
		
		ДанныеУведомления.Вставить("Дата", Формат(ДатаЗаявления, "ДФ='dd.MM.yyyy''г.'''"));
		
		Если ЗначениеЗаполнено(СтруктураДанныхУполномоченноеЛицоОрганизации) Тогда
			ДанныеУведомления.Вставить("ОтветственныйДолжность",	СтруктураДанныхУполномоченноеЛицоОрганизации.Должность);
			ДанныеУведомления.Вставить("Ответственный",				Строка(СтруктураДанныхУполномоченноеЛицоОрганизации.КонтактноеЛицо));
		КонецЕсли;
		
		ДобавитьВидыАктивовВСтруктуруДанных(ДанныеУведомления, ЗаявлениеНаВключение, СписокВидовАктивовДоИзменения.ВыгрузитьЗначения(), СписокВидовАктивовИзДокумента.ВыгрузитьЗначения());
				
		РазрешеныПаи = СтрНайти(ДанныеУведомления["СделкиЦенныеБумагиИПФИ"], "паевых инвестиционных фондов") > 0;
		ДанныеУведомления.Вставить("ПокупкаПаевПлюс",	РазрешеныПаи);
		ДанныеУведомления.Вставить("ПокупкаПаевМинус", 	РазрешеныПаи);
		ДанныеУведомления.Вставить("ПричинаИсключения",	?(ПустаяСтрока(ПричинаИсключенияКвалифицированногоЛица), "  ", ПричинаИсключенияКвалифицированногоЛица));
		
		ДанныеУведомления.Вставить("ВсеВидыАктивов", 	ВидИзменения = Перечисления.ВидыИзмененийПеречней.Исключение);
		ДанныеУведомления.Вставить("НеВсеВидыАктивов", 	ВидИзменения <> Перечисления.ВидыИзмененийПеречней.Исключение);
		ДанныеУведомления.Вставить("Исключен", 			?(ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо, "исключено", "исключен"));
				
		Результат.Вставить("ДанныеУведомления",	ДанныеУведомления);
		
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Печать не будет выполнена! Не удалось определить данные о клиенте для заполнения уведомления.");
		Возврат Неопределено;
	КонецЕсли;
	
	#КонецОбласти
	
	Результат.Вставить("АдресШаблонов",		ПоместитьШаблоныВоВременноеХранилищеЗаявленияИУведомления());
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ДобавитьАдресВСтруктуруДанных(ДанныеЗаявления, СтруктураАдреса, ПостфиксПолей = "");
	
	ДанныеЗаявления.Вставить("Индекс" + ПостфиксПолей, ?(ПустаяСтрока(СтруктураАдреса.Индекс), "  ", СтруктураАдреса.Индекс));
	
	ПредставлениеАдреса = СтруктураАдреса.ПредставлениеАдреса;
	
	// Страна Россия может быть не указана, но быть в представлении
	Если ПустаяСтрока(СтруктураАдреса.Страна) Тогда
		Если ВРЕГ(Лев(ПредставлениеАдреса, 6)) = "РОССИЯ" Тогда
			Страна = Лев(ПредставлениеАдреса, 6);
		Иначе
			Страна = "  ";
		КонецЕсли;
	КонецЕсли;
		
	ДанныеЗаявления.Вставить("Страна" + ПостфиксПолей, Страна);
	
	//Из представления удаляем индекс и страну, т. к. они уже получены      		
	ПредставлениеАдреса = ?(ПустаяСтрока(СтруктураАдреса.Индекс), ПредставлениеАдреса, СтрЗаменить(ПредставлениеАдреса, СтруктураАдреса.Индекс + ",", ""));
	ПредставлениеАдреса = СтрЗаменить(ПредставлениеАдреса, Страна + ",", "");
	ПредставлениеАдреса = СокрЛП(ПредставлениеАдреса);
	
	ДанныеЗаявления.Вставить("Адрес" + ПостфиксПолей, ПредставлениеАдреса);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьДанныеОПодтверждающихДокументахВСтруктуруДанных(ДанныеЗаявления, ПодтверждающиеДокументы, КоличествоСтрок)
	
	Для Сч = 1 По КоличествоСтрок Цикл
		ДанныеЗаявления.Вставить("Строка" + СокрЛП(Сч), "  ");
	КонецЦикла;
	
	Если ТипЗнч(ПодтверждающиеДокументы) = Тип("Структура") Тогда                               					
		РаботаСКоллекциями.ДополнитьСтруктуру(ДанныеЗаявления, ПодтверждающиеДокументы, Истина);
	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьВидыАктивовВСтруктуруДанных(ДанныеЗаявления, ЗаявлениеНаВключение, ВидыАктивовНаНачало, ВидыАктивовТекущие)
	
	// Заполнение по умолчанию
	ДанныеЗаявления.Вставить("Услуги", 						"-");
	ДанныеЗаявления.Вставить("СделкиЦенныеБумагиИПФИ", 		"-");
	ДанныеЗаявления.Вставить("ИныеФинансовыеИнструменты", 	"-");
	
	СтруктураИзменений = Документы.ВнесениеИзмененийВоВнутреннийПеречень.СформироватьСтруктуруИзмененийСоставаВидовАктивов(ВидыАктивовНаНачало, ВидыАктивовТекущие);
	
	СтруктураСтрокВидовАктивов = Новый Структура;
	
	ВидыАктивов = ?(ЗаявлениеНаВключение, СтруктураИзменений.ДобавленныеВидыАктивов, СтруктураИзменений.УдаленныеВидыАктивов);
	
	ГруппаУслуги				 = ОбщегоНазначения.ПолучитьИменованныйОбъект("ВидыАктивовКИ_Услуги");
	ГруппаСделкиИЦенныеБумаги	 = ОбщегоНазначения.ПолучитьИменованныйОбъект("ВидыАктивовКИ_СделкиИЦБ");
	ГруппаИныеФИ				 = ОбщегоНазначения.ПолучитьИменованныйОбъект("ВидыАктивовКИ_ИныеФИ");
	
	СоответствиеГрупп = Новый Соответствие;
	СоответствиеГрупп.Вставить(ГруппаУслуги, 				"Услуги");
	СоответствиеГрупп.Вставить(ГруппаСделкиИЦенныеБумаги, 	"СделкиЦенныеБумагиИПФИ");
	СоответствиеГрупп.Вставить(ГруппаИныеФИ, 				"ИныеФинансовыеИнструменты");
		
	Для Каждого ВидАктива Из ВидыАктивов Цикл
		
		Родитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидАктива, "Родитель");
		
		ИмяГруппы = СоответствиеГрупп.Получить(Родитель);
		
		Если ИмяГруппы = Неопределено Тогда
			ВызватьИсключение "Не найдено соответствие виду актива '" + СокрЛП(Родитель) + "' в печатной форме";	
		КонецЕсли;
		
		СтруктураСтрокВидовАктивов.Вставить(ИмяГруппы, 	
				?(СтруктураСтрокВидовАктивов.Свойство(ИмяГруппы), 
				СтруктураСтрокВидовАктивов[ИмяГруппы] + Символы.ВК + " - " + СокрЛП(ВидАктива), 
				" - " + СокрЛП(ВидАктива)));
		
	КонецЦикла;
	
	РаботаСКоллекциями.ДополнитьСтруктуру(ДанныеЗаявления, СтруктураСтрокВидовАктивов, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьШаблонWord(ДокументWord, ДанныеДляЗаполнения)
	
	ПеременныеДокумента = ДокументWord.Variables;
	ПоляДокумента = ДокументWord.FormFields;
	
	Для Каждого КлючИЗначение из ДанныеДляЗаполнения Цикл
		
		Попытка
			// ищем переменные
			Переменная = ПеременныеДокумента.Item(КлючИЗначение.Ключ);
			Переменная.Value = КлючИЗначение.Значение;
		Исключение
		КонецПопытки;
		
		Попытка
			// ищем чек-боксы
			Поле = ПоляДокумента.Item(КлючИЗначение.Ключ);
			Поле.CheckBox.Value = КлючИЗначение.Значение;
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
	ДокументWord.Fields.Update();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИПоказатьШаблон(WordApp, ФайлШаблона, ДанныеДляЗаполнения)
	
	НовыйДокумент = WordApp.Application.Documents.Add(ФайлШаблона, Ложь, , Истина);
	
	ЗаполнитьШаблонWord(НовыйДокумент, ДанныеДляЗаполнения);
	
КонецПроцедуры

&НаСервере
Функция ПоместитьШаблоныВоВременноеХранилищеЗаявленияИУведомления()
	
	Если ЭтаФорма.ЗаявлениеНаВключение Тогда
		ИмяМакета = "ЗаявлениеОПризнанииКвалифицированнымИнвестором";
	Иначе
		ИмяМакета = "ЗаявлениеНаИсключениеИзРеестраКвалифицированныхИнвесторов";
	КонецЕсли;
	
	ИмяМакета = ИмяМакета + ?(Клиент.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо, "ФЛ", "ЮЛ");
	ДанныеЗаявления = Документы.ВнесениеИзмененийВоВнутреннийПеречень.ПолучитьМакет(ИмяМакета);
	
	Шаблоны = Новый Структура;
	Шаблоны.Вставить("Заявление",	ДанныеЗаявления);
	
	Если ЭтаФорма.ЗаявлениеНаВключение Тогда
		Шаблоны.Вставить("Уведомление",	Документы.ВнесениеИзмененийВоВнутреннийПеречень.ПолучитьМакет("УведомлениеОПризнанииКвалифицированнымИнвестором"));
		
		Если Клиент.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо Тогда
			Шаблоны.Вставить("УведомлениеОПоследствиях",	Документы.ВнесениеИзмененийВоВнутреннийПеречень.ПолучитьМакет("УведомлениеОПоследствияхПризнанияКвалифицированнымИнвестором"));
		КонецЕсли;
	Иначе	
		Шаблоны.Вставить("Уведомление",	Документы.ВнесениеИзмененийВоВнутреннийПеречень.ПолучитьМакет("УведомлениеОбИсключенииИзРеестраКвалифицированныхИнвесторов"));
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(Шаблоны, УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокВидовАктивовИПодтверждающиеДокументыНаСервере()
	
	СписокВидовАктивовИзДокумента = ПолучитьСписокВидовАктивовИзДокумента(Параметры.Документ);
	
	ДокументОбъект = Параметры.Документ.ПолучитьОбъект();
	
	СтруктураПодтверждающихДокументов = ДокументОбъект.ПодтверждающиеДокументыКвалифицированногоИнвестора.Получить();	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокВидовАктивовИзДокумента(ДокументСсылка)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВнесениеИзмененийВоВнутреннийПереченьВидыАктивовКвалифицированныхИнвесторов.ВидАктива КАК ВидАктива
		|ИЗ
		|	Документ.ВнесениеИзмененийВоВнутреннийПеречень.ВидыАктивовКвалифицированныхИнвесторов КАК ВнесениеИзмененийВоВнутреннийПереченьВидыАктивовКвалифицированныхИнвесторов
		|ГДЕ
		|	ВнесениеИзмененийВоВнутреннийПереченьВидыАктивовКвалифицированныхИнвесторов.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.ВидАктива);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.Имя = "УполномоченноеЛицоОрганизации" Тогда 
		Параметрыформы = РаботаСОтчетами.ПолучитьПараметрыФормыВыбораКонтактногоЛица(Новый Структура("Организация, КонтактноеЛицо", Организация, УполномоченноеЛицоОрганизации));		
	ИначеЕсли Элемент.Имя = "СотрудникОрганизацииПринявшийЗаявление" Тогда	
		Параметрыформы = РаботаСОтчетами.ПолучитьПараметрыФормыВыбораКонтактногоЛица(Новый Структура("Организация, КонтактноеЛицо", Организация, СотрудникОрганизацииПринявшийЗаявление));
	КонецЕсли;	
	
	ОткрытьФормуМодально("РегистрСведений.КонтактныеЛица.ФормаСписка", ПараметрыФормы, Элемент, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	Если Элемент.Имя = "УполномоченноеЛицоОрганизации" Тогда 
		Если НЕ ЗначениеЗаполнено(ЭтаФорма.УполномоченноеЛицоОрганизации) Тогда
			СтруктураДанныхУполномоченноеЛицоОрганизации = Неопределено;
		КонецЕсли;	
	ИначеЕсли Элемент.Имя = "СотрудникОрганизацииПринявшийЗаявление" Тогда
		Если НЕ ЗначениеЗаполнено(ЭтаФорма.СотрудникОрганизацииПринявшийЗаявление) Тогда
			СтруктураДанныхСотрудникОрганизацииПринявшийЗаявление = Неопределено;	
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СотрудникОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(ВыбранноеЗначение);	
	ВыбранноеЗначение = СтруктураДанныхКонтактногоЛица.КонтактноеЛицо;	
	
	Если Элемент.Имя = "УполномоченноеЛицоОрганизации" Тогда 
		СтруктураДанныхУполномоченноеЛицоОрганизации = СтруктураДанныхКонтактногоЛица;	
	ИначеЕсли Элемент.Имя = "СотрудникОрганизацииПринявшийЗаявление" Тогда
		СтруктураДанныхСотрудникОрганизацииПринявшийЗаявление = СтруктураДанныхКонтактногоЛица;
	КонецЕсли;	
		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПроверитьРеквизитыДокумента(РеквизитыДокумента, ЗаявлениеНаВключение, Отказ)
	
	ТекстОшибки = "";
	
	// Проверяем явные противоречия
	Если РеквизитыДокумента.ВидПеречня <> Справочники.ВидыПеречнейОбъектов.КвалифицированныеИнвесторы Тогда
		ТекстОшибки = "Печать предназначена только для документов в видом перечня 'Квалифицированные инвесторы'";  		
	КонецЕсли;
	
	Если РеквизитыДокумента.ВидПеречня = Справочники.ВидыПеречнейОбъектов.КвалифицированныеИнвесторы Тогда
		
		Если РеквизитыДокумента.ВидИзменения = Перечисления.ВидыИзмененийПеречней.Включение И Не ЗаявлениеНаВключение Тогда
			ТекстОшибки = "Печать заявления на исключение не предназначена для документов в видом изменения 'Включение'";
		КонецЕсли;
			
		Если РеквизитыДокумента.ВидИзменения = Перечисления.ВидыИзмененийПеречней.Исключение И ЗаявлениеНаВключение Тогда
			ТекстОшибки = "Печать заявления на включение не предназначена для документов в видом изменения 'Исключение'";
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ПустаяСтрока(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,,Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
